## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.terraform-azure-collection.azurerm_application_insights.observe_insights will be created
  + resource "azurerm_application_insights" "observe_insights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "centralus"
      + name                                  = "observeApplicationInsights"
      + resource_group_name                   = "gh-rg-nikhil-function-vnet"
      + retention_in_days                     = 90
      + sampling_percentage                   = 100
    }

  # module.terraform-azure-collection.azurerm_linux_function_app.observe_collect_function_app will be updated in-place
  ~ resource "azurerm_linux_function_app" "observe_collect_function_app" {
      ~ app_settings                                   = {
          - "AZURE_CLIENT_ID"                               = "309add39-e5c2-4eb8-ad91-939e2acbc464"
          - "AZURE_CLIENT_LOCATION"                         = "centralus"
          - "AZURE_CLIENT_SECRET"                           = "@Microsoft.KeyVault(SecretUri=https://ghkvnikhilfunctionvnet.vault.azure.net/secrets/observe-password/176e0c6275c4439cbc60f9eda7b312b4)"
          - "AZURE_TENANT_ID"                               = "81665909-a4e6-466b-9671-4d9ef491267f"
          - "AzureWebJobsDisableHomepage"                   = "true"
          - "EVENTHUB_TRIGGER_FUNCTION_EVENTHUB_CONNECTION" = (sensitive value)
          - "EVENTHUB_TRIGGER_FUNCTION_EVENTHUB_NAME"       = "gh-eh-nikhil-function-vnet"
          - "FEATURE_FLAGS"                                 = null
          - "OBSERVE_CUSTOMER"                              = "179969258044"
          - "OBSERVE_DOMAIN"                                = "observe-staging.com"
          - "OBSERVE_TOKEN"                                 = "@Microsoft.KeyVault(SecretUri=https://ghkvnikhilfunctionvnet.vault.azure.net/secrets/observe-token/98b7fc5f3605461cb03f6010346c3336)"
          - "WEBSITE_RUN_FROM_PACKAGE"                      = "https://observeinc.s3.us-west-2.amazonaws.com/azure/azure-collection-functions-0.11.4.zip"
          - "timer_resources_func_schedule"                 = "0 */10 * * * *"
          - "timer_vm_metrics_func_schedule"                = "30 */5 * * * *"
        } -> (known after apply)
        id                                             = "/subscriptions/080291cf-8419-427c-953c-944e6c351029/resourceGroups/gh-rg-nikhil-function-vnet/providers/Microsoft.Web/sites/gh-fa-nikhil-function-vnet"
        name                                           = "gh-fa-nikhil-function-vnet"
        tags                                           = {
            "branch"     = "nikhil-function-vnet"
            "created_by" = "terraform-ci"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```
</details>